eisup_2019_docmng_integration/src/DataProcessors/абс_ЗагрузитьРеестрОСизExcel/абс_ЗагрузитьРеестрОСизExcel.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>абс_ЗагрузитьРеестрОСизExcel</name>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаОС</name>
    <type>
      <types>EnumRef.ГруппыОС</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ЗначенияСвойствОС/абс_ЗначенияСвойствОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ЗначенияСвойствОС</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.абс_СвойстваОС</types>
    </type>
  </resources>
  <dimensions>
    <name>ОС</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.абс_СвойстваОС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/ГруппыОС/ГруппыОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГруппыОС</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Здания</name>
  </enumValues>
  <enumValues>
    <name>Сооружения</name>
  </enumValues>
  <enumValues>
    <name>абс_СооруженияНедвижимость</name>
  </enumValues>
  <enumValues>
    <name>МашиныИОборудование</name>
  </enumValues>
  <enumValues>
    <name>ОфисноеОборудование</name>
  </enumValues>
  <enumValues>
    <name>ТранспортныеСредства</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственныйИХозяйственныйИнвентарь</name>
  </enumValues>
  <enumValues>
    <name>РабочийСкот</name>
  </enumValues>
  <enumValues>
    <name>ПродуктивныйСкот</name>
  </enumValues>
  <enumValues>
    <name>МноголетниеНасаждения</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныеУчастки</name>
  </enumValues>
  <enumValues>
    <name>ОбъектыПриродопользования</name>
  </enumValues>
  <enumValues>
    <name>ДругиеВидыОсновныхСредств</name>
  </enumValues>
  <enumValues>
    <name>КапитальныеВложенияВАрендованноеИмущество</name>
  </enumValues>
  <enumValues>
    <name>ВычислительнаяТехника</name>
  </enumValues>
  <enumValues>
    <name>ПрочееИмуществоТребующееГосударственнойРегистрации</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_АрендуемоеСобственное/абс_АрендуемоеСобственное.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_АрендуемоеСобственное</name>
  <enumValues>
    <name>Арендуемое</name>
  </enumValues>
  <enumValues>
    <name>Собственное</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_ТипКровли/абс_ТипКровли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ТипКровли</name>
  <enumValues>
    <name>Мягкая</name>
  </enumValues>
  <enumValues>
    <name>Твердая</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/DataProcessors/абс_ЗагрузитьРеестрОСизExcel/ObjectModule.bsl
Перем ДеревоСвойств Экспорт;
Перем Excel;
Перем Workbook;  



Процедура ПрочитатьФайл() Экспорт
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
	Исключение
		Сообщить("Не найдена установленная версия MS Excel");
		Возврат;
	КонецПопытки;
	
	Попытка
		Workbook = Excel.Workbooks.Open(ПутьКФайлу);
	Исключение
		Сообщить("Не удается открыть файл по указанному пути");
		Возврат;
	КонецПопытки;
	
	Workbook.Activate();

							
	Попытка  			
		
		ОпределитьГруппуОС();
		ДеревоСвойств = ПланыВидовХарактеристик.абс_СвойстваОС.ПолучитьДеревоСвойств(
					Справочники.ОсновныеСредства.ПустаяСсылка(),ГруппаОС,
					Перечисления.абс_ВидыОбъектовНевижимостиОС.ПустаяСсылка());

		ЗаполнитьДерево();
		
	Исключение
		
		Сообщить(ИнформацияОбОшибке().Описание + " Номер строки: " + ИнформацияОбОшибке().НомерСтроки);
		
	КонецПопытки;	
	
	Workbook.Close();
	Excel.Quit();
							
КонецПроцедуры

Процедура ЗаписатьСвойства() Экспорт
	
	Для й = 7 по ДеревоСвойств.Колонки.Количество()-1 Цикл 
		
		КодОС = ДеревоСвойств.Колонки[й].Имя;
		ОС = Справочники.ОсновныеСредства.НайтиПоКоду(КодОС);
		
		Если ОС = Неопределено ИЛИ ОС.Пустая() Тогда 
			Сообщить("[НЕ НАЙДЕНО ОС ПО КОДУ] " + Строка(КодОС));
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.абс_ЗначенияСвойствОС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОС.Установить(ОС);
		
		РазобратьДерево(НаборЗаписей, ДеревоСвойств, ОС, ДеревоСвойств.Колонки[й].Имя);
		
		НаборЗаписей.Записать();
 
		
	КонецЦикла;
	
	Сообщить("[ЗАГРУЗКА ЗАВЕРШЕНА]");

	
КонецПроцедуры



Процедура ЗаполнитьДерево()
	
	Sheet = Excel.Sheets(1);	
	й = 2; ж = 4;
	КоличествоСтрок = Sheet.Cells.SpecialCells(11).Row;
	КоличествоКолонок = Sheet.Cells.SpecialCells(11).Column;

	Пока ж <=КоличествоКолонок Цикл	
		
		КодОС = СокрЛП(Sheet.Cells(1, ж).Text);
		ДеревоСвойств.Колонки.Добавить(КодОС, ДеревоСвойств.Колонки.Значение.ТипЗначения); 
		
		Пока й <= КоличествоСтрок Цикл 
			
			ОбработкаПрерыванияПользователя();
			КодСвойства = СокрЛП(Sheet.Cells(й, 1).Text);
			
			Если ПустаяСтрока(КодСвойства) Тогда 
				й = й + 1;
				Продолжить;
			КонецЕсли;
	
			Свойство = ПланыВидовХарактеристик.абс_СвойстваОС.НайтиПоКоду(КодСвойства);
			
			Если Свойство = Неопределено ИЛИ Свойство.Пустая() Тогда 
				Сообщить("[НЕ НАЙДЕНО СВОЙСТВО ПО КОДУ] " + Строка(КодСвойства));
				й = й + 1;
				Продолжить;
			КонецЕсли;
			
			Если Свойство.ЭтоГруппа Тогда 
				й = й + 1;
				Продолжить;
			КонецЕсли;
			
			строкаДерева = ДеревоСвойств.Строки.Найти(Свойство, "Свойство", Истина);
			
			Если строкаДерева = Неопределено Тогда 
				Сообщить("[НЕ НАЙДЕНО СВОЙСТВО ] " + Строка(Свойство));
			КонецЕсли;
			
			строкаДерева[КодОС] = СокрЛП(Sheet.Cells(й, ж).Value); 
			
			й = й + 1;		
			
		КонецЦикла;
		
		ж = ж + 1;
		й = 2;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОпределитьГруппуОС()
	
	ГруппаОС.Пустая();
	
	Sheet = Excel.Sheets(1);	
	й = 2; 
	КоличествоСтрок = Sheet.Cells.SpecialCells(11).Row;
	
	Пока й <= КоличествоСтрок Цикл 
		
		ОбработкаПрерыванияПользователя();
		КодСвойства = СокрЛП(Sheet.Cells(й, 1).Text);
		
		Если ПустаяСтрока(КодСвойства) Тогда 
			й = й + 1;
			Продолжить;
		КонецЕсли;
		
		Свойство = ПланыВидовХарактеристик.абс_СвойстваОС.НайтиПоКоду(КодСвойства);
		
		Если Свойство = Неопределено ИЛИ Свойство.Пустая() Тогда 
			й = й + 1;
			Продолжить;
		КонецЕсли;
		
		Если Свойство.ТранспортноеСредство Тогда 
			ГруппаОС = Перечисления.ГруппыОС.ТранспортныеСредства;
			Возврат;
		Иначе
			ГруппаОС = Перечисления.ГруппыОС.Здания;
			Возврат;
		КонецЕсли;
	
	КонецЦикла;
		
КонецПроцедуры
	
Процедура РазобратьДерево(НаборЗаписей, Ветка, ОС, Колонка)
	
	Для Каждого строка из Ветка.Строки Цикл
		
		Если НЕ строка.ЭтоГруппа Тогда 
			строкаНабора = НаборЗаписей.Добавить();
			строкаНабора.ОС = ОС;
			строкаНабора.Свойство = строка.Свойство;
			строкаНабора.Значение = ПолучитьЗначение(строка, строка[Колонка]);
		КонецЕсли;
		
		Если строка.Строки.Количество() > 0 Тогда 
			РазобратьДерево(НаборЗаписей,строка, ОС, Колонка);
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

Функция ПолучитьЗначение(строка, Значение)
	
	ЗначениеРеестра = Значение;
	ТекущийТип = строка.ТипЗначения;
	ЗначениеРеестра = ТекущийТип.ПривестиЗначение(Значение);
	
	Если ТипЗнч(ЗначениеРеестра) = Тип("Булево") Тогда
		Если Значение = "Да" Тогда 
			ЗначениеРеестра =  Истина;
		ИначеЕсли Значение = "Нет" Тогда 
			ЗначениеРеестра = Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЗначениеРеестра) = Тип("СправочникСсылка.Контрагенты") Тогда 
   		ЗначениеРеестра = Справочники.Контрагенты.НайтиПоКоду(СокрЛп(Значение));
	ИначеЕсли ТипЗнч(ЗначениеРеестра) = Тип("СправочникСсылка.Должности") Тогда 
   		ЗначениеРеестра = Справочники.Должности.НайтиПоКоду(СокрЛп(Значение));
	ИначеЕсли ТипЗнч(ЗначениеРеестра) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда 
   		ЗначениеРеестра = Справочники.Должности.НайтиПоКоду(СокрЛп(Значение));
	ИначеЕсли ТипЗнч(ЗначениеРеестра) = Тип("ПеречислениеСсылка.абс_АрендуемоеСобственное") Тогда
		Если Значение = "Арендуемое" Тогда
			ЗначениеРеестра = Перечисления.абс_АрендуемоеСобственное.Арендуемое;	
		ИначеЕсли Значение = "Собственное" Тогда
			ЗначениеРеестра = Перечисления.абс_АрендуемоеСобственное.Собственное;	
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЗначениеРеестра) = Тип("ПеречислениеСсылка.абс_ТипКровли") Тогда
		Если Значение = "Мягкая" Тогда
			ЗначениеРеестра = Перечисления.абс_ТипКровли.Мягкая;	
		ИначеЕсли Значение = "Твердая" Тогда
			ЗначениеРеестра = Перечисления.абс_ТипКровли.Твердая;	
		КонецЕсли;			
	КонецЕсли;
	
	Возврат ЗначениеРеестра;
	
КонецФункции
